"""
    Программа принимает на ввод координаты точки - x и y.
    Выводит, в какой четверти системы координат лежит точка.
                ^ y
                |
            II  |    I
                |
        --------=-------->
                |         x
            III |    IV
                |
"""
x = int(input('Вісь Ох: '))
y = int(input('Вісь Оy: '))
print()
if (x > 0) and (y > 0):
    print('Точка лежить в І чверті системи координат.')
elif (x < 0) and (y > 0):
    print('Точка лежить в ІІ чверті системи координат.')
elif (x < 0) and (y < 0):
    print('Точка лежить в ІІI чверті системи координат.')
elif (x > 0) and (y < 0):
    print('Точка лежить в ІV чверті системи координат.')
elif (x == 0) and (y != 0):
    print('Точка лежить на вісі Оy.')
elif (x != 0) and (y == 0):
    print('Точка лежить на вісі Ох.')
else:
    print('Точка лежить на початку системи координат.')