"""
    Программа принимает на ввод 4 числа.
    Необходимо сложить первые два и отдельно вторые два.
    Разделить первую сумму на вторую.
    Вывести результат на экран.
"""
a = int(input('Введіть перше число а: '))
b = int(input('Введіть друге число b: '))
c = int(input('Введіть третє число с: '))
d = int(input('Введіть четверте число d: '))
print()
print('Результат розрахунку', (a + b) / (c + d))
